azurefunction/get-mrvtrainstatus/sampleldbws.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types" 
    xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
    <soapenv:Header>
        <typ:AccessToken>
            <typ:TokenValue>tokenwashere</typ:TokenValue>
        </typ:AccessToken>
    </soapenv:Header>
    <soapenv:Body>
        <ldb:GetArrBoardWithDetailsRequest>
            <ldb:numRows>10</ldb:numRows>
            <ldb:crs>OKL</ldb:crs>
            <ldb:timeOffset>0</ldb:timeOffset>
            <ldb:timeWindow>60</ldb:timeWindow>
        </ldb:GetArrBoardWithDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>